abbreviate
shorten
abstract
according
acronym
address
alter
always
analogy
analysis
analyze
annotate
anticipate
apply
approach
appropriate
approximate
argue
argument
arrange
aspect
assemble
assert
assess
associate
assume
assumption
authentic
background
body
brainstorm
brief
calculate
caption
cause
character
characteristic
characterize
chart
chronology
citation
claim
clarify
class
clue
code
coherent
common
compile
complement
complete
compose
composition
conceive
concise
conclusion
concrete
conditions
conduct
consequence
consider
consistent
consistently
constant
constitute
consult
contend
context
contradict
control
convert
convey
copy
correlate
correspond
credit
criterion
critique
crucial
cumulative
debate
deduce
demand
demonstrate
depict
derive
describe
detail
determine
develop
devise
diction
dimension
diminish
discipline
discover
discriminate
discuss
distinguish
domain
draft
edit
elements
emphasize
employ
equal
equivalent
essential
establish
estimate
evaluate
event
evidence
exaggerate
example
excerpt
exclude
exercise
exhibit
explain
explore
extract
fact
factor
feature
gurative
gure
focus
foreshadow
form
format
former
formulate
fragment
frame
general
genre
graph
graphic
header
heading
highlight
identify
illustrate
imitate
imply
inclined
include
incorporate
indirect
infer
inform
inquire
instructions
integrate
intention
interact
intermittent
interpret
introduce
introduction
invariably
involve
irony
irrelevant
isolate
italic
judge
key
likely
list
literal
locate
logical
main
margin
measure
metaphor
method
model
modify
monitor
motivation
narrator
never
notation
note
notice
objective
observe
opinion
oppose
optional
order
organize
origin
outline
generate
paraphrase
participation
passage
pattern
perform
perspective
persuade
plagiarism
plan
plausible
plot
point
portray
preclude
predict
prepare
presume
preview
previous
prior
probably
procedure
process
produce
project
proofread
property
propose
prose
prove
purpose
quotation
rank
rare
rarely
reaction
recall
reduce
refer
regular
relate
relationship
relevant
rephrase
report
represent
request
require
requisite
respond
responsible
restate
result
review
revise
root
rule
scan
score
sequence
set
setting
show
signal
simile
skim
source
spatial
speculate
stance
standard
state
strategy
structure
study
style
subject
subjective
subsequent
succinct
suggest
sum
summarize
summary
support
survey
synonym
synthesize
table
technique
term
test
theme
timeline
tone
topic
trace
trait
transition
translate
unique
utilize
valid
variation
vary
verify
viewpoint
economy
chat
